snlkuharlocal/src/DataProcessors/b2b_АРМ_ОтработкаЗаказовССайта/b2b_АРМ_ОтработкаЗаказовССайта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>b2b_АРМ_ОтработкаЗаказовССайта</name>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/b2b_Дозаказы/b2b_Дозаказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>b2b_Дозаказы</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаказОсновной</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПРМ</name>
    <type>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПодтвержденияПоДозаказу</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДоЗаказа_b2b</name>
    <type>
      <types>EnumRef.b2b_СтатусыДоЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаОтгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/b2b_ЗаявкиКлиентов/b2b_ЗаявкиКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>b2b_ЗаявкиКлиентов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоРезерв</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаБезСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СтатусЗаказа_b2b</name>
    <type>
      <types>EnumRef.b2b_СтатусыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновленияДозаказа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаОтгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтменыЗаявки</name>
    <type>
      <types>CatalogRef.b2b_ПричиныОтменыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтменыОтгрузкиЗаказа</name>
    <type>
      <types>CatalogRef.b2b_ПричиныОтменыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтменыОтгрузкиДозаказа</name>
    <type>
      <types>CatalogRef.b2b_ПричиныОтменыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопСкидкаНаНакладную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкидкаНаНакладную</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отгружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/b2b_СтатусыЗаказов/b2b_СтатусыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>b2b_СтатусыЗаказов</name>
  <enumValues>
    <name>ЖдетОбработки</name>
  </enumValues>
  <enumValues>
    <name>ЖдетПодтвержденияДистрибьютором</name>
  </enumValues>
  <enumValues>
    <name>ЖдетПодтвержденияКлиентом</name>
  </enumValues>
  <enumValues>
    <name>Согласована</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноВыполнена</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ИсточникЗаказа/ИсточникЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИсточникЗаказа</name>
  <enumValues>
    <name>БазаТЦфранчайзинг</name>
  </enumValues>
  <enumValues>
    <name>Сайт</name>
  </enumValues>
  <enumValues>
    <name>РучнойВвод</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СостоянияЗаказаКонтрагента/СостоянияЗаказаКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияЗаказаКонтрагента</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденныйЗаказ</name>
  </enumValues>
  <enumValues>
    <name>Оплачен</name>
  </enumValues>
  <enumValues>
    <name>ЗаказаноПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВыполненЧастично</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СостоянияСогласования/СостоянияСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияСогласования</name>
  <enumValues>
    <name>НаСогласованииЦО</name>
  </enumValues>
  <enumValues>
    <name>НаСогласованииКонтрагент</name>
  </enumValues>
  <enumValues>
    <name>ОтмененЦО</name>
  </enumValues>
  <enumValues>
    <name>ОтмененКонтрагент</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/DataProcessors/b2b_АРМ_ОтработкаЗаказовССайта/Forms/ФормаУправляемая/Module.bsl
#Область ОбработчикиФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ЗаказыКработе.Параметры.УстановитьЗначениеПараметра("ПоказатьЗагруженные",ЛОЖЬ);
	//ЗаказыКработе.Параметры.УстановитьЗначениеПараметра("МассивИзмененные",Новый Массив);
	//
	//ЗаказыСогласованные.Параметры.УстановитьЗначениеПараметра("ПоказатьЗагруженные",ЛОЖЬ);
	//ЗаказыСогласованные.Параметры.УстановитьЗначениеПараметра("МассивИзмененные",Новый Массив);
	//
	//ВсеЗаказы.Параметры.УстановитьЗначениеПараметра("ПоказатьЗагруженные",ЛОЖЬ);
	//ВсеЗаказы.Параметры.УстановитьЗначениеПараметра("МассивИзмененные",Новый Массив);
	
	ПериодОбновленияЗаявок.Вариант = ВариантСтандартногоПериода.Сегодня; 
	
	УстановитьУсловноеОформление();
	
	ЗаполнитьПараметрыДинамическогоСписка();
	
		
КонецПроцедуры


	
#КонецОбласти

#Область  СлужебныеПроцедурыФункции 	

/////////////////////загрузка заказов 
&НаКлиенте
Процедура ОбновитьЗаказы(Команда)
	ОбновитьЗаказыНаСервере(); 
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ОбновитьЗаказыНаСервере(ПоВыбраннойЗаявке = неопределено)
	
	ПараметрыПолучения = Новый Структура;
	
	Если ЗначениеЗаполнено(ПоВыбраннойЗаявке) Тогда
			
		ПараметрыПолучения.Вставить("номерЗаявки",ПоВыбраннойЗаявке.НомерЗаказа);
		
		ПараметрыПолучения.Вставить("ИзЗаказа",Истина);
	
	КонецЕсли;

	Если ОтборПоСтатусам.Количество() > 0   Тогда
		
		ПараметрыПолучения.Вставить("СтатусыЗаказов",ОтборПоСтатусам.ВыгрузитьЗначения()); 	
		
	КонецЕсли;
	Если ЗначениеЗаполнено(ПериодСозданияЗаявок)   Тогда
		
		ПараметрыПолучения.Вставить("ДатаСозданияНачало",ПериодСозданияЗаявок.ДатаНачала); 
		ПараметрыПолучения.Вставить("ДатаСозданияОкончание",ПериодСозданияЗаявок.ДатаОкончания);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПериодОбновленияЗаявок)   Тогда
		
		ПараметрыПолучения.Вставить("ДатаОбновленияНачало",ПериодОбновленияЗаявок.ДатаНачала); 
		ПараметрыПолучения.Вставить("ДатаОбновленияОкончание",ПериодОбновленияЗаявок.ДатаОкончания);
		
	КонецЕсли;
	
	Если  ЗначениеЗаполнено(ОтборПоКонтрагентуДляЗагрузки) Тогда
	
		ПараметрыПолучения.Вставить("Пользователь",ОтборПоКонтрагентуДляЗагрузки.КодВторичногоКонтрагентаДляB2B);
	
	КонецЕсли;

		
	ОбновленныеЗаказы = Новый Массив; 
	
	b2b_ОбменЗаявками.ПолучениеДанныхПоЗаказам(ПараметрыПолучения,ОбновленныеЗаказы); 
	
	//подумать еще как отразить изменения.... на форме 
	//ЗаказыКработе.Параметры.УстановитьЗначениеПараметра("ПоказатьЗагруженные",Истина);
	//ЗаказыКработе.Параметры.УстановитьЗначениеПараметра("МассивИзмененные",ОбновленныеЗаказы);
	//
	//ЗаказыСогласованные.Параметры.УстановитьЗначениеПараметра("ПоказатьЗагруженные",Истина);
	//ЗаказыСогласованные.Параметры.УстановитьЗначениеПараметра("МассивИзмененные",ОбновленныеЗаказы);
	//
	Элементы.ЗаказыКработе.Обновить();
	Элементы.ЗаказыСогласованные.Обновить();
	Элементы.ЗаказыЗавершенные.Обновить();
	Элементы.ВсеЗаказы.Обновить();
	
КонецПроцедуры // ОбновитьЗаказыНаСервере()


&НаКлиенте
Процедура ОбновитьВыбранныйЗаказ(Команда)
	ВыделенныеСтроки = Элементы.ЗаказыКработе.ВыделенныеСтроки; 
	
	Если ВыделенныеСтроки.Количество() > 0  Тогда
		
		ИдентификаторСтроки = ВыделенныеСтроки[0];
		Элементы.ЗаказыКработе.ТекущаяСтрока = ИдентификаторСтроки; 
		ДанныеСтроки =  Элементы.ЗаказыКработе.ТекущиеДанные; 
		
		ОбновитьЗаказыНаСервере(ДанныеСтроки.Ссылка); 	
	
	КонецЕсли;
	
	
КонецПроцедуры

//отправка данных по дозаказам 

&НаКлиенте
Процедура ОтправитьЗапросДоЗаказ(Команда)
	 //только через форму изменения заказа
	//Оповещение = Новый ОписаниеОповещения("ОтправитьНаДозаказВопрос",ЭтаФорма); 
	//
	//СписокВопрос = Новый СписокЗначений; 
	//СписокВопрос.Добавить("ПоВсем","По всем"); 
	//СписокВопрос.Добавить("ПоВыделенным","По выделенным заказам"); 
	//
	//ПоказатьВопрос(Оповещение,"По всем или по выделенному заказу?",СписокВопрос); 
	 
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ОтправитьНаДозаказВопрос(ОтветНаВопрос,ДополнительныеПараметры) Экспорт 
	
	ЗаказыНаОтправку = Новый Массив; 
	Если ОтветНаВопрос = "ПоВсем" Тогда
		
		ЗаказыНаОтправку = ПолучитьЗаказыНаОтправку(); 
	
	ИначеЕсли ОтветНаВопрос = "ПоВыделенным" Тогда	
		
		ВыделенныеСтроки = Элементы.ЗаказыКработе.ВыделенныеСтроки; 
		
		Если ВыделенныеСтроки.Количество() > 0  Тогда
			Для каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
				
				ИдентификаторСтроки = ВыделеннаяСтрока;	
				Элементы.ЗаказыКработе.ТекущаяСтрока = ИдентификаторСтроки; 
				ДанныеСтроки =  Элементы.ЗаказыКработе.ТекущиеДанные;
				Если НЕ ДанныеСтроки.ЕстьДозаказ Тогда
				
					Продолжить; 	
				Иначе 
					ЗаказыНаОтправку.Добавить(ДанныеСтроки); 
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	
	Иначе 
		Возврат; 
	КонецЕсли;
	
	Если ЗаказыНаОтправку.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(,"Не найдены заказы для отправки информации по дозаказам"); 
		
		Возврат; 	
	
	КонецЕсли;

	//ЗаказыНаОтправкуНовые = СоздатьНовыеДокументыДозаказа(ЗаказыНаОтправку); 
	b2b_ОбменЗаявками.ОтправитьЗапросДоЗаказНаСервере(ЗаказыНаОтправку);

КонецПроцедуры // ()


// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьЗаказыНаОтправку()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаказДокумент.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Заказ КАК ЗаказДокумент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.b2b_Дозаказы КАК b2b_Дозаказы
		|		ПО ЗаказДокумент.Ссылка = b2b_Дозаказы.Заказ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.b2b_ЗаявкиКлиентов КАК b2b_ЗаявкиКлиентов
		|		ПО ЗаказДокумент.Ссылка = b2b_ЗаявкиКлиентов.Заказ
		|			И (b2b_ЗаявкиКлиентов.СтатусЗаказа_b2b = ЗНАЧЕНИЕ(Перечисление.b2b_СтатусыЗаказов.ЖдетПодтвержденияДистрибьютором))
		|ГДЕ
		|	ЗаказДокумент.ИсточникЗаказа = ЗНАЧЕНИЕ(Перечисление.ИсточникЗаказа.Сайт)";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ссылка");
	
КонецФункции // ()


&НаКлиенте
Процедура ИзменитьЗаказ(Команда)
	
	ТекущиеДанные = Элементы.ЗаказыКработе.ТекущиеДанные; 
	Если ТекущиеДанные = неопределено Тогда
	
		Возврат; 	
	
	КонецЕсли;
	
	ЭтоДозаказ = ТекущиеДанные.ЭтоДозаказ; 
	//ОткрытьФорму("Обработка.b2b_АРМ_ОтработкаЗаказовССайта.Форма.ФормаЗаказа",Новый Структура("Заказ,ЭтоДозаказ",ТекущиеДанные.ссылка,ЭтоДозаказ),ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	ПараметрЗакрытия = ОткрытьФормуМодально("Обработка.b2b_АРМ_ОтработкаЗаказовССайта.Форма.ФормаЗаказа",Новый Структура("Заказ,ЭтоДозаказ",ТекущиеДанные.ссылка,ЭтоДозаказ),ЭтаФорма); 
	
	Если  ТипЗнч(ПараметрЗакрытия)  = Тип("Структура")
		И ПараметрЗакрытия.Свойство("Сообщить") Тогда
		
		ОткрытьФормуМодально("Обработка.b2b_АРМ_ОтработкаЗаказовССайта.Форма.ФормаСообщение",ПараметрЗакрытия,ЭтаФорма,); 
		
	КонецЕсли;
	
	Элементы.ЗаказыКработе.Обновить();
 
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРНК(Команда)
	
	ВыделенныеСтроки = Элементы.ЗаказыСогласованные.ВыделенныеСтроки; 
	
	Если ВыделенныеСтроки.Количество() > 0  Тогда
		
		ИдентификаторСтроки = ВыделенныеСтроки[0];
		Элементы.ЗаказыСогласованные.ТекущаяСтрока = ИдентификаторСтроки; 
		ДанныеСтроки =  Элементы.ЗаказыСогласованные.ТекущиеДанные; 
		
		Заказ  = ДанныеСтроки.ссылка; 
		
		
		СостояниеЗаказаДБ1 = ПредопределенноеЗначение("Перечисление.СостоянияЗаказаКонтрагента.ВРаботе");
		СостояниеЗаказаДБ2 = ПредопределенноеЗначение("Перечисление.СостоянияЗаказаКонтрагента.ВыполненЧастично");
		СостояниеСогласованияДБ = ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Согласован"); 
		
		РезультатПроверкиСостояния1 = b2b_ОбменЗаявками.ПроверитьСостояниеЗаказа(Заказ, СостояниеЗаказаДБ1,СостояниеСогласованияДБ);
		РезультатПроверкиСостояния2 = b2b_ОбменЗаявками.ПроверитьСостояниеЗаказа(Заказ, СостояниеЗаказаДБ2,СостояниеСогласованияДБ);
				
		Если НЕ (РезультатПроверкиСостояния1 ИЛИ РезультатПроверкиСостояния2) Тогда
			
			ПоказатьПредупреждение(,"Состояния заказов должно быть ""В работе"""); 
			
			Возврат; 	
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.ДатаОтгрузки) Тогда
			
			ПоказатьПредупреждение(,"Необходимо заполнить в заказах поле ""Дата отгрузки""");
			
			Возврат; 
		 	
		КонецЕсли;
		
		Если НачалоДня(ДанныеСтроки.ДатаОтгрузки) <= НачалоДня(ТекущаяДата()) Тогда
		
			ПоказатьПредупреждение(,"Необходимо поменять плановую дату отгрузки, она должна быть больше текущей даты");
			
			Возврат;	
		
		КонецЕсли;

				
		РНКСуществующее = неопределено; 
		РезультатПроверкиСвязи =  b2b_ОбменЗаявками.ПроверитьСвязьСРНК(ДанныеСтроки.ссылка,РНКСуществующее); 
		Если НЕ РезультатПроверкиСвязи
			 И ЗначениеЗаполнено(РНКСуществующее) Тогда 
			
					
			ПараметрыФормы = Новый Структура("Ключ", РНКСуществующее);
			ОткрытьФорму("Документ.РасходнаяНакладная.Форма.ФормаДокумента", ПараметрыФормы);
			
		Иначе 
			//проверить, что выбран метод доставки
			
			МетодДоставки = b2b_ОбменЗаявками.МетодДоставкиПоЗаказу(ДанныеСтроки.ссылка);
			
			Если НЕ ЗначениеЗаполнено(МетодДоставки)
				 И ДанныеСтроки.ЕстьДозаказ Тогда
				
				МетодыДоставки = Новый СписокЗначений; 				
				МетодыДоставки.Добавить("F","Заказ и дозаказ вместе"); 
				МетодыДоставки.Добавить("P","Заказ и дозаказ отдельно");
				
				СтруктураПараметров = Новый Структура("Заказ,Этодозаказ",ДанныеСтроки.ссылка,ДанныеСтроки.ЭтоДозаказ); 
				
				ОповещениеВыборИзСписка = Новый ОписаниеОповещения("ВыборИзСпискаМетодДоставки",ЭтаФорма,СтруктураПараметров); 
				
				ПоказатьВыборИзСписка(ОповещениеВыборИзСписка,МетодыДоставки); 
			Иначе 				
				
				МассивСообщений = Новый Массив;
				РНКСуществующее = b2b_ОбменЗаявками.СоздатьРНКНаСервере(ДанныеСтроки.Ссылка,ДанныеСтроки.ЭтоДозаказ,МассивСообщений);
				
				Если ЗначениеЗаполнено(РНКСуществующее)  Тогда  				
					 
					ПараметрыФормы = Новый Структура("Ключ", РНКСуществующее);
					ОткрытьФорму("Документ.РасходнаяНакладная.Форма.ФормаДокумента", ПараметрыФормы);
					
					
				КонецЕсли;
			КонецЕсли;
			 
			
			
		КонецЕсли;

		 	
		
	КонецЕсли;
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ВыборИзСпискаМетодДоставки(ВыбранноеЗначение,ДополнительныеПараметры) Экспорт 
	
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение.Значение)  Тогда
		
		Если  ДополнительныеПараметры.Этодозаказ Тогда
			
			ОсновнойЗаказ = b2b_ОбменЗаявками.НайтиОсновнойЗаказпоДозаказу(ДополнительныеПараметры.Заказ); 	
		Иначе
			
			ОсновнойЗаказ =  ДополнительныеПараметры.Заказ; 
			
		КонецЕсли;
		
		ПараметрыЗаписиВРегистр = Новый Структура; 
		ПараметрыЗаписиВРегистр.Вставить("МетодДоставки",ВыбранноеЗначение.Значение);
		b2b_ОбменЗаявками.ЗаписатьДополнительныеДанныеВРегистрЗаказов(ОсновнойЗаказ,ПараметрыЗаписиВРегистр); 		
		
		МассивСообщений = Новый Массив;
		РНКСуществующее = b2b_ОбменЗаявками.СоздатьРНКНаСервере(ДополнительныеПараметры.Заказ,ДополнительныеПараметры.Этодозаказ,МассивСообщений);
		
		Если ЗначениеЗаполнено(РНКСуществующее)  Тогда
			
			ПараметрыФормы = Новый Структура("Ключ", РНКСуществующее);
			ОткрытьФорму("Документ.РасходнаяНакладная.Форма.ФормаДокумента", ПараметрыФормы);
			
			
		КонецЕсли;

	КонецЕсли;
	

КонецПроцедуры // ВыборИзСпискаМетодДоставки()


// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
//&НаСервереБезКонтекста
//Функция ПроверитьСостояниеЗаказа(Знач ЗаказКлиента, СостояниеЗаказа, СостояниеСогласования)

//	Возврат ЗаказКлиента.СостояниеНакладной = СостояниеЗаказа И ЗаказКлиента.СостояниеСогласования = СостояниеСогласования; 
//		
//КонецФункции // ПроверитьСостояниеЗаказа()


// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
//&НаСервере
//Функция СоздатьРНКНаСервере(Знач Заказ,
//	ЭтоДозаказ)
//	
//	НовыйДокумент = Документы.РасходнаяНакладная.СоздатьДокумент();
//	НовыйДокумент.Заполнить(Заказ);
//	Попытка
//	
//		НовыйДокумент.Записать(РежимЗаписиДокумента.Запись); 
//		
//		//; 
//		
//		b2b_ОбменЗаявками.ЗаписатьСоответствиеРНКЗаказ(Заказ,НовыйДокумент.Ссылка);
//		
//		МетодДоставки = b2b_ОбменЗаявками.МетодДоставкиПоЗаказу(Заказ);
//		
//		ПараметрыНаОтправку = Новый Структура;
//		ПараметрыНаОтправку.Вставить("НомерЗаявки",Заказ.НомерЗаказа);
//		
//		Если МетодДоставки = "F"  и НЕ ЭтоДозаказ Тогда
//		
//			ТипЗапроса = "ОтправитьДатуОтгрузкиВместе";
//			
//			ПараметрыНаОтправку.Вставить("ДатаОтгрузкиЗаказа",Заказ.ДатаОтгрузки);
//		
//		КонецЕсли;
//		
//		Если МетодДоставки = "P"  Тогда
//		
//			ТипЗапроса = "ОтправитьДатуОтгрузкиОтдельно";
//			
//			Если ЭтоДозаказ  Тогда
//			
//				ПараметрыНаОтправку.Вставить("ДатаОтгрузкиДозаказа",Заказ.ДатаОтгрузки);
//				
//			Иначе 
//				
//				ПараметрыНаОтправку.Вставить("ДатаОтгрузкиЗаказа",Заказ.ДатаОтгрузки);
//				
//			КонецЕсли;
//		
//		КонецЕсли;
//		
//		 
//		
//		b2b_ОбменЗаявками.ЗаписатьВОчередьНаОтправку(Заказ,ТипЗапроса,ПараметрыНаОтправку); 
//		
//		
//		
//		Возврат НовыйДокумент.Ссылка; 
//		
//	Исключение
//		
//		Сообщить(ОписаниеОшибки()); 
//		
//	КонецПопытки;
//	
//КонецФункции // СоздатьРНКНаСервере()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура СоздатьРНКПроверкаВопрос(ОтветНаВопрос,ДополнительныеПараметры)  Экспорт 

	   Если ОтветНаВопрос = КодВозвратаДиалога.Да  Тогда
	   
	   	
	   
	   КонецЕсли;

КонецПроцедуры // СоздатьРНКПроверкаВопрос()

&НаСервере
Процедура ОтработатьЗапросыВОчередиНаСервере()
	b2b_ОбменЗаявками.ОтработатьЗапросыВОчереди();
КонецПроцедуры

&НаКлиенте
Процедура ОтработатьЗапросыВОчереди(Команда)
	ОтработатьЗапросыВОчередиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыКработеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	ТекущиеДанные = Элементы.ЗаказыКработе.ТекущиеДанные; 
	Если ТекущиеДанные = неопределено Тогда
	
		Возврат; 	
	
	КонецЕсли;
	
	ЭтоДозаказ = ТекущиеДанные.ЭтоДозаказ; 
	//ОткрытьФорму("Обработка.b2b_АРМ_ОтработкаЗаказовССайта.Форма.ФормаЗаказа",Новый Структура("Заказ,ЭтоДозаказ",ТекущиеДанные.ссылка,ЭтоДозаказ),ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	ПараметрЗакрытия = ОткрытьФормуМодально("Обработка.b2b_АРМ_ОтработкаЗаказовССайта.Форма.ФормаЗаказа",Новый Структура("Заказ,ЭтоДозаказ",ТекущиеДанные.ссылка,ЭтоДозаказ),ЭтаФорма); 
	
	Если  ТипЗнч(ПараметрЗакрытия)  = Тип("Структура")
		И ПараметрЗакрытия.Свойство("Сообщить") Тогда
		
		ОткрытьФормуМодально("Обработка.b2b_АРМ_ОтработкаЗаказовССайта.Форма.ФормаСообщение",ПараметрЗакрытия,ЭтаФорма,); 
		
	КонецЕсли;
	
	Элементы.ЗаказыКработе.Обновить();
	
КонецПроцедуры

Процедура УстановитьУсловноеОформление()

	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ЗаказыКработе");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЗаказыКработе.Загружен");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Хаки);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ЗаказыСогласованные");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЗаказыСогласованные.Загружен");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Хаки);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ЗаказыЗавершенные");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЗаказыЗавершенные.Загружен");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Хаки);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ВсеЗаказы");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВсеЗаказы.Загружен");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Хаки);

	//Элемент = УсловноеОформление.Элементы.Добавить();
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаказыСогласованныеМетодДоставки);
	//
	//ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЗаказыСогласованные.МетодДоставки");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение = "F";
	//
	//Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Заказ и дозаказ вместе");
	//
	//Элемент = УсловноеОформление.Элементы.Добавить();
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаказыСогласованныеМетодДоставки);
	//
	//ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЗаказыСогласованные.МетодДоставки");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение = "P";
	//
	//Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Заказ и дозаказ отдельно");


КонецПроцедуры

&НаКлиенте
Процедура ЗаказыСогласованныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	ТекущиеДанные = Элементы.ЗаказыСогласованные.ТекущиеДанные; 
	Если ТекущиеДанные = неопределено Тогда
	
		Возврат; 	
	
	КонецЕсли;
	
	ЭтоДозаказ = ТекущиеДанные.ЭтоДозаказ; 
	//ОткрытьФорму("Обработка.b2b_АРМ_ОтработкаЗаказовССайта.Форма.ФормаЗаказа",Новый Структура("Заказ,ЭтоДозаказ",ТекущиеДанные.ссылка,ЭтоДозаказ),ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	ПараметрЗакрытия = ОткрытьФормуМодально("Обработка.b2b_АРМ_ОтработкаЗаказовССайта.Форма.ФормаЗаказа",Новый Структура("Заказ,ЭтоДозаказ",ТекущиеДанные.ссылка,ЭтоДозаказ),ЭтаФорма,); 
	
	Если  ТипЗнч(ПараметрЗакрытия)  = Тип("Структура")
		И ПараметрЗакрытия.Свойство("Сообщить") Тогда
		
		ОткрытьФормуМодально("Обработка.b2b_АРМ_ОтработкаЗаказовССайта.Форма.ФормаСообщение",ПараметрЗакрытия,ЭтаФорма,); 
		
	КонецЕсли;
	
	Элементы.ЗаказыСогласованные.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыЗавершенныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	ТекущиеДанные = Элементы.ЗаказыЗавершенные.ТекущиеДанные; 
	Если ТекущиеДанные = неопределено Тогда
	
		Возврат; 	
	
	КонецЕсли;
	
	ЭтоДозаказ = ТекущиеДанные.ЭтоДозаказ; 
	//ОткрытьФорму("Обработка.b2b_АРМ_ОтработкаЗаказовССайта.Форма.ФормаЗаказа",Новый Структура("Заказ,ЭтоДозаказ",ТекущиеДанные.ссылка,ЭтоДозаказ),ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	ПараметрЗакрытия = ОткрытьФормуМодально("Обработка.b2b_АРМ_ОтработкаЗаказовССайта.Форма.ФормаЗаказа",Новый Структура("Заказ,ЭтоДозаказ",ТекущиеДанные.ссылка,ЭтоДозаказ),ЭтаФорма); 
	
	Если  ТипЗнч(ПараметрЗакрытия)  = Тип("Структура")
		И ПараметрЗакрытия.Свойство("Сообщить") Тогда
		
		ОткрытьФормуМодально("Обработка.b2b_АРМ_ОтработкаЗаказовССайта.Форма.ФормаСообщение",ПараметрЗакрытия,ЭтаФорма,); 
		
	КонецЕсли;
	
	Элементы.ЗаказыЗавершенные.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВыбранныйЗаказСогласованные(Команда)
	ВыделенныеСтроки = Элементы.ЗаказыСогласованные.ВыделенныеСтроки; 
	
	Если ВыделенныеСтроки.Количество() > 0  Тогда
		
		ИдентификаторСтроки = ВыделенныеСтроки[0];
		Элементы.ЗаказыСогласованные.ТекущаяСтрока = ИдентификаторСтроки; 
		ДанныеСтроки =  Элементы.ЗаказыСогласованные.ТекущиеДанные; 
		
		ОбновитьЗаказыНаСервере(ДанныеСтроки.Ссылка); 	
	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗавершитьВыполненныеЗаказыНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыполненныеЗаказы(Команда)
	ЗавершитьВыполненныеЗаказыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтработатьОтгруженныеРНК(Команда)
	b2b_ОбменЗаявками.ОтработатьОтгруженныеЗаказы();
КонецПроцедуры

&НаСервере
Процедура ОтметитьКакПросмотренныйНаСервере(Знач Заказ)
	
	b2b_ОбменЗаявками.ОчиститьРегистрОбновленныеЗаказыПоЗаказу(Заказ); 
	
	 
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьКакПросмотренный(Команда)
	
	АктивнаяСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница;
	
	Если АктивнаяСтраница.Имя = "ЗаказыНаОтработку" Тогда
		
		Имятаблицы = "ЗаказыКработе";  
		
	ИначеЕсли АктивнаяСтраница.Имя = "СогласованныеЗаказы" Тогда
		
		Имятаблицы = "ЗаказыСогласованные";
		
	ИначеЕсли АктивнаяСтраница.Имя = "ОтгруженныеЗаказы" Тогда
		
		Имятаблицы = "ЗаказыЗавершенные";
		
	ИначеЕсли АктивнаяСтраница.Имя = "ВсеЗаказыСтраница" Тогда
		
		Имятаблицы = "ВсеЗаказы";
		
	Иначе
		Сообщить("Не найдено активной страницы"); 
		Возврат; 
		
	КонецЕсли;
	ВыделенныеЗаказы = Элементы[Имятаблицы].ВыделенныеСтроки; 
	Для каждого ВыделенныйЭлемент Из ВыделенныеЗаказы Цикл
		//
		//ИдентификаторСтроки = ВыделенныйЭлемент; 
		//Элементы[Имятаблицы].ТекущаяСтрока = ИдентификаторСтроки; 
		//ДанныеСтроки =  Элементы[Имятаблицы].ТекущиеДанные;
		
		ОтметитьКакПросмотренныйНаСервере(ВыделенныйЭлемент.ссылка);	
	
	КонецЦикла;
	
	Элементы[Имятаблицы].Обновить();
	
	
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьВсеКакПросмотренныеНаСервере()
	b2b_ОбменЗаявками.ОчиститьРегистрОбновленныеЗаказыПоЗаказу(неопределено,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсеКакПросмотренные(Команда)
	ОтметитьВсеКакПросмотренныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВсеЗаказыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	ТекущиеДанные = Элементы.ВсеЗаказы.ТекущиеДанные; 
	Если ТекущиеДанные = неопределено Тогда
	
		Возврат; 	
	
	КонецЕсли;
	
	ЭтоДозаказ = ТекущиеДанные.ЭтоДозаказ; 
	//ОткрытьФорму("Обработка.b2b_АРМ_ОтработкаЗаказовССайта.Форма.ФормаЗаказа",Новый Структура("Заказ,ЭтоДозаказ",ТекущиеДанные.ссылка,ЭтоДозаказ),ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	ПараметрЗакрытия = ОткрытьФормуМодально("Обработка.b2b_АРМ_ОтработкаЗаказовССайта.Форма.ФормаЗаказа",Новый Структура("Заказ,ЭтоДозаказ",ТекущиеДанные.ссылка,ЭтоДозаказ),ЭтаФорма,); 
	
	Если  ТипЗнч(ПараметрЗакрытия)  = Тип("Структура")
		И ПараметрЗакрытия.Свойство("Сообщить") Тогда
		
		ОткрытьФормуМодально("Обработка.b2b_АРМ_ОтработкаЗаказовССайта.Форма.ФормаСообщение",ПараметрЗакрытия,ЭтаФорма,); 
		
	КонецЕсли;

	
	Элементы.ВсеЗаказы.Обновить();
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьОстаткиНаСайтНаСервере(ЗаписыватьШтрихкод = Ложь)
	
	ПараметрыДляВыгрузкиОстатков = Новый Структура;
	
	НастройкиДляВыгрузкиОстатков = b2b_ОбменЗаявками.ПолучитьПараметрыМетодаВыгрузкиОстатковДистрибьютора(); 
	
	ПараметрыДляВыгрузкиОстатков.Вставить("IDПользователя",НастройкиДляВыгрузкиОстатков.IDПользователяНаСайте); ////"SMS-0383");
	ПараметрыДляВыгрузкиОстатков.Вставить("ЗаписыватьШтрихкод",ЗаписыватьШтрихкод); 
	
	ПотокМассивовТоваров = b2b_ОбменЗаявками.ОстаткиДляОтправкиНаСайт();
	Сч = 1; 
	Для каждого  МассивТоваров Из ПотокМассивовТоваров Цикл
	
		ПараметрыДляВыгрузкиОстатков.Вставить("Товары",МассивТоваров);
		
		МассивСообщений = Новый Массив; 
		b2b_ОбменЗаявками.ЗаписатьВОчередьНаОтправку("Остатки","ВыгрузкаОстатков" + Формат(Сч,"ЧГ=0"),ПараметрыДляВыгрузкиОстатков,МассивСообщений);	
	    Сч = Сч + 1; 
	КонецЦикла;
			
		
		
	//КонецЕсли;
	
	 
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОстаткиНаСайт(Команда)
	ВыгрузитьОстаткиНаСайтНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОстаткиНаСайтШтрихКод(Команда)
	ВыгрузитьОстаткиНаСайтНаСервере(истина); 
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ЗаполнитьПараметрыДинамическогоСписка()

	ЗаказыКработе.Параметры.УстановитьЗначениеПараметра("ОтборПоСтатусамЗаявок",ОтборПоСтатусамЗаявокСписка.Количество()>0);    
	ЗаказыКработе.Параметры.УстановитьЗначениеПараметра("СтатусыЗаявок",ОтборПоСтатусамЗаявокСписка);
	ЗаказыКработе.Параметры.УстановитьЗначениеПараметра("ОтборПоСтатусамДозаказов",ОтборПоСтатусамДоЗаявокСписка.Количество()>0);    
	ЗаказыКработе.Параметры.УстановитьЗначениеПараметра("СтатусыДозаказов",ОтборПоСтатусамДоЗаявокСписка);
	ЗаказыКработе.Параметры.УстановитьЗначениеПараметра("ОтборПоКонтрагенту",ЗначениеЗаполнено(ОтборПоКонтрагенту));    
	ЗаказыКработе.Параметры.УстановитьЗначениеПараметра("Контрагент",ОтборПоКонтрагенту);
	
	ЗаказыСогласованные.Параметры.УстановитьЗначениеПараметра("ОтборПоСтатусамЗаявок",ОтборПоСтатусамЗаявокСписка.Количество()>0);    
	ЗаказыСогласованные.Параметры.УстановитьЗначениеПараметра("СтатусыЗаявок",ОтборПоСтатусамЗаявокСписка);
	ЗаказыСогласованные.Параметры.УстановитьЗначениеПараметра("ОтборПоСтатусамДозаказов",ОтборПоСтатусамДоЗаявокСписка.Количество()>0);    
	ЗаказыСогласованные.Параметры.УстановитьЗначениеПараметра("СтатусыДозаказов",ОтборПоСтатусамДоЗаявокСписка);
	ЗаказыСогласованные.Параметры.УстановитьЗначениеПараметра("ОтборПоКонтрагенту",ЗначениеЗаполнено(ОтборПоКонтрагенту));    
	ЗаказыСогласованные.Параметры.УстановитьЗначениеПараметра("Контрагент",ОтборПоКонтрагенту);
	
	ВсеЗаказы.Параметры.УстановитьЗначениеПараметра("ОтборПоСтатусамЗаявок",ОтборПоСтатусамЗаявокСписка.Количество()>0);    
	ВсеЗаказы.Параметры.УстановитьЗначениеПараметра("СтатусыЗаявок",ОтборПоСтатусамЗаявокСписка);
	ВсеЗаказы.Параметры.УстановитьЗначениеПараметра("ОтборПоСтатусамДозаказов",ОтборПоСтатусамДоЗаявокСписка.Количество()>0);    
	ВсеЗаказы.Параметры.УстановитьЗначениеПараметра("СтатусыДозаказов",ОтборПоСтатусамДоЗаявокСписка);
	ВсеЗаказы.Параметры.УстановитьЗначениеПараметра("ОтборПоКонтрагенту",ЗначениеЗаполнено(ОтборПоКонтрагенту));    
	ВсеЗаказы.Параметры.УстановитьЗначениеПараметра("Контрагент",ОтборПоКонтрагенту);
	
	ЗаказыЗавершенные.Параметры.УстановитьЗначениеПараметра("ОтборПоСтатусамЗаявок",ОтборПоСтатусамЗаявокСписка.Количество()>0);    
	ЗаказыЗавершенные.Параметры.УстановитьЗначениеПараметра("СтатусыЗаявок",ОтборПоСтатусамЗаявокСписка);
	ЗаказыЗавершенные.Параметры.УстановитьЗначениеПараметра("ОтборПоСтатусамДозаказов",ОтборПоСтатусамДоЗаявокСписка.Количество()>0);    
	ЗаказыЗавершенные.Параметры.УстановитьЗначениеПараметра("СтатусыДозаказов",ОтборПоСтатусамДоЗаявокСписка);
	ЗаказыЗавершенные.Параметры.УстановитьЗначениеПараметра("ОтборПоКонтрагенту",ЗначениеЗаполнено(ОтборПоКонтрагенту));    
	ЗаказыЗавершенные.Параметры.УстановитьЗначениеПараметра("Контрагент",ОтборПоКонтрагенту);

	

КонецПроцедуры // ЗаполнитьПараметрыДинамическогоСписка()

&НаКлиенте
Процедура ОтборПоСтатусамЗаявокСпискаПриИзменении(Элемент)
	ЗаполнитьПараметрыДинамическогоСписка(); 
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСтатусамЗаявокСпискаОчистка(Элемент, СтандартнаяОбработка)
	ЗаполнитьПараметрыДинамическогоСписка(); 
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСтатусамДоЗаявокСпискаПриИзменении(Элемент)
	ЗаполнитьПараметрыДинамическогоСписка(); 
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСтатусамДоЗаявокСпискаОчистка(Элемент, СтандартнаяОбработка)
	ЗаполнитьПараметрыДинамическогоСписка(); 
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоКонтрагентуПриИзменении(Элемент)
	ЗаполнитьПараметрыДинамическогоСписка(); 
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоКонтрагентуОчистка(Элемент, СтандартнаяОбработка)
	ЗаполнитьПараметрыДинамическогоСписка(); 
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтбор(Команда)
	
	ОтборПоСтатусамДоЗаявокСписка.Очистить();
	ОтборПоСтатусамЗаявокСписка.Очистить();
	ОтборПоКонтрагенту = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
	
	ЗаполнитьПараметрыДинамическогоСписка(); 
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРНКПоВыделенным(Команда)
	
	
	ВыделенныеЗаказы = Элементы.ЗаказыСогласованные.ВыделенныеСтроки;
	МассивЗаказов = Новый Массив;
	
	КонтрагентПервый = неопределено; 
	Для каждого ВыделенныйЭлемент Из ВыделенныеЗаказы Цикл
		
		//ИдентификаторСтроки = ВыделенныйЭлемент; 
		//Элементы.ЗаказыСогласованные.ТекущаяСтрока = ИдентификаторСтроки; 
		//ДанныеСтроки =  Элементы.ЗаказыСогласованные.ТекущиеДанные;
		ДокументЗаказ = ВыделенныйЭлемент.ссылка; 
		
		Если КонтрагентПервый = Неопределено Тогда  			
			
			КонтрагентПервый = ВыделенныйЭлемент.Контрагент; 
			
		КонецЕсли;
		
		Если КонтрагентПервый <> ВыделенныйЭлемент.Контрагент Тогда
			
			Сообщить("Заказ был исключен, так как контрагент не соответствует контрагенту первой выделенной строки " + Строка(ДокументЗаказ)); 
			
			Продолжить; 
		
		КонецЕсли;
		
		
		СостояниеЗаказаДБ1 = ПредопределенноеЗначение("Перечисление.СостоянияЗаказаКонтрагента.ВРаботе");
		СостояниеЗаказаДБ2 = ПредопределенноеЗначение("Перечисление.СостоянияЗаказаКонтрагента.ВыполненЧастично");
		СостояниеСогласованияДБ = ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Согласован"); 
		
		РезультатПроверкиСостояния1 = b2b_ОбменЗаявками.ПроверитьСостояниеЗаказа(ВыделенныйЭлемент.ссылка, СостояниеЗаказаДБ1,СостояниеСогласованияДБ);
		РезультатПроверкиСостояния2 = b2b_ОбменЗаявками.ПроверитьСостояниеЗаказа(ВыделенныйЭлемент.ссылка, СостояниеЗаказаДБ2,СостояниеСогласованияДБ);
		
		
		Если НЕ (РезультатПроверкиСостояния1 ИЛИ РезультатПроверкиСостояния2) Тогда
			
			Сообщить( "Состояние заказа должно быть ""В работе"" " + Строка(ВыделенныйЭлемент.ссылка)); 
			
			Продолжить; 	
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВыделенныйЭлемент.ДатаОтгрузки)Тогда
			
			Сообщить("Необходимо заполнить в заказе поле ""Дата отгрузки"" " + Строка(ВыделенныйЭлемент.ссылка));
			
			Продолжить; 
		 	
		КонецЕсли;
		
		Если НачалоДня(ВыделенныйЭлемент.ДатаОтгрузки) <= НачалоДня(ТекущаяДата()) Тогда
		
			Сообщить("Необходимо поменять плановую дату отгрузки, она должна быть больше текущей даты " + Строка(ВыделенныйЭлемент.ссылка));
			
			Продолжить;	
		
		КонецЕсли;
		
		РНК1 = неопределено; 
		РНК1СвязьПустая = b2b_ОбменЗаявками.ПроверитьСвязьСРНК(ВыделенныйЭлемент.ссылка,РНК1);
		Если НЕ РНК1СвязьПустая Тогда
			
			Сообщить("Ранее были созданы РНК по заказу " + Строка(ВыделенныйЭлемент.ссылка) + ":" + Строка(РНК1));
			Продолжить; 
			
		КонецЕсли;
		

		 
		МассивЗаказов.Добавить(ВыделенныйЭлемент.ссылка); 				
		
	КонецЦикла;
	Если МассивЗаказов.Количество() > 0 Тогда
		МассивСообщений = Новый Массив; 
		РНКСуществующее = b2b_ОбменЗаявками.СоздатьРНКПоНесколькимЗаказам(МассивЗаказов,МассивСообщений);
		
		Если ЗначениеЗаполнено(РНКСуществующее)  Тогда  				
			
			ПараметрыФормы = Новый Структура("Ключ", РНКСуществующее);
			ОткрытьФорму("Документ.РасходнаяНакладная.Форма.ФормаДокумента", ПараметрыФормы);
			
			
		КонецЕсли;

	КонецЕсли;
КонецПроцедуры

//&НаКлиенте
//Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
//	Если ИмяСобытия = "ОткрытьФормуСообщенияb2b" Тогда
//	
//		ОткрытьФорму("Обработка.b2b_АРМ_ОтработкаЗаказовССайта.Форма.ФормаСообщение",Параметр,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.Независимый);
//	
//	КонецЕсли;
//КонецПроцедуры


#КонецОбласти
